### Terraform `plan` Succeeded for Workspace: `default`
  
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_storage_blob.training_content_blobs["../web_content/index.html"] must be replaced
-/+ resource "azurerm_storage_blob" "training_content_blobs" {
!       access_tier            = "Hot" -> (known after apply)
!       content_md5            = "af992460659db657d3d14a1f78e90e43" -> "eb00b7153be54e3fd02882c6c843a28d" # forces replacement
!       id                     = "https://tamughtrnbedge.blob.core.windows.net/$web/index.html" -> (known after apply)
!       metadata               = {} -> (known after apply)
        name                   = "index.html"
!       url                    = "https://tamughtrnbedge.blob.core.windows.net/$web/index.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>
  